Revit 2024 API
Reference Methods
The Reference type exposes the following members.
Methods
Name | Description
Contains
Checks if given reference identifies part of object identified by this reference.
ConvertToStableRepresentation
Converts the reference to a stable String representation.
CreateLinkReference
Creates a Reference from a Reference in an RVT Link.
CreateReferenceInLink
Creates a Reference in an RVT Link from a Reference in the RVT host file.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
EqualTo
Checks if given reference is equal to this reference.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ParseFromStableRepresentation
Converts a stable String representation of a reference to a Reference object.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Reference Class
Autodesk.Revit.DB Namespace